armfly/H7-TOOL_STM32H7_App/User/bsp/src/bsp_uart_fifo.c
#if UART7_FIFO_EN == 1
	g_tUart7.uart = UART7;						/* STM32 串口设备 */
	g_tUart7.pTxBuf = g_TxBuf7;					/* 发送缓冲区指针 */
	g_tUart7.pRxBuf = g_RxBuf7;					/* 接收缓冲区指针 */
	g_tUart7.usTxBufSize = UART7_TX_BUF_SIZE;	/* 发送缓冲区大小 */
	g_tUart7.usRxBufSize = UART7_RX_BUF_SIZE;	/* 接收缓冲区大小 */
	g_tUart7.usTxWrite = 0;						/* 发送FIFO写索引 */
	g_tUart7.usTxRead = 0;						/* 发送FIFO读索引 */
	g_tUart7.usRxWrite = 0;						/* 接收FIFO写索引 */
	g_tUart7.usRxRead = 0;						/* 接收FIFO读索引 */
	g_tUart7.usRxCount = 0;						/* 接收到的新数据个数 */
	g_tUart7.usTxCount = 0;						/* 待发送的数据个数 */
	g_tUart7.SendBefor = 0;						/* 发送数据前的回调函数 */
	g_tUart7.SendOver = 0;						/* 发送完毕后的回调函数 */
	g_tUart7.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
	g_tUart7.Sending = 0;						/* 正在发送中标志 */
#endif


#if UART8_FIFO_EN == 1
	g_tUart8.uart = UART8;						/* STM32 串口设备 */
	g_tUart8.pTxBuf = g_TxBuf8;					/* 发送缓冲区指针 */
	g_tUart8.pRxBuf = g_RxBuf8;					/* 接收缓冲区指针 */
	g_tUart8.usTxBufSize = UART8_TX_BUF_SIZE;	/* 发送缓冲区大小 */
	g_tUart8.usRxBufSize = UART8_RX_BUF_SIZE;	/* 接收缓冲区大小 */
	g_tUart8.usTxWrite = 0;						/* 发送FIFO写索引 */
	g_tUart8.usTxRead = 0;						/* 发送FIFO读索引 */
	g_tUart8.usRxWrite = 0;						/* 接收FIFO写索引 */
	g_tUart8.usRxRead = 0;						/* 接收FIFO读索引 */
	g_tUart8.usRxCount = 0;						/* 接收到的新数据个数 */
	g_tUart8.usTxCount = 0;						/* 待发送的数据个数 */
	g_tUart8.SendBefor = 0;						/* 发送数据前的回调函数 */
	g_tUart8.SendOver = 0;						/* 发送完毕后的回调函数 */
	g_tUart8.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
	g_tUart8.Sending = 0;						/* 正在发送中标志 */
#endif

#if UART_USB_FIFO_EN == 1
	g_tUartUSB.uart = UART8;						/* STM32 串口设备 */
	g_tUartUSB.pTxBuf = g_TxBufUSB;					/* 发送缓冲区指针 */
	g_tUartUSB.pRxBuf = g_RxBufUSB;					/* 接收缓冲区指针 */
	g_tUartUSB.usTxBufSize = UART_USB_TX_BUF_SIZE;	/* 发送缓冲区大小 */
	g_tUartUSB.usRxBufSize = UART_USB_RX_BUF_SIZE;	/* 接收缓冲区大小 */
	g_tUartUSB.usTxWrite = 0;						/* 发送FIFO写索引 */
	g_tUartUSB.usTxRead = 0;						/* 发送FIFO读索引 */
	g_tUartUSB.usRxWrite = 0;						/* 接收FIFO写索引 */
	g_tUartUSB.usRxCount = 0;						/* 接收到的新数据个数 */
	g_tUartUSB.usTxCount = 0;						/* 待发送的数据个数 */
	g_tUartUSB.SendBefor = 0;						/* 发送数据前的回调函数 */
	g_tUartUSB.SendOver = 0;						/* 发送完毕后的回调函数 */
	g_tUartUSB.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
	g_tUartUSB.Sending = 0;						/* 正在发送中标志 */
#endif
}

/*
*********************************************************************************************************
*	函 数 名: bsp_SetUartParam
*	功能说明: 配置串口的硬件参数（波特率，数据位，停止位，起始位，校验位，中断使能）适合于STM32-F4开发板
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_SetUartParam(USART_TypeDef *Instance,  uint32_t BaudRate, uint32_t Parity, uint32_t Mode)
{
	UART_HandleTypeDef UartHandle;	
	
	/* 第2步： 配置串口硬件参数 */
	/*##-1- Configure the UART peripheral ######################################*/
	/* Put the USART peripheral in the Asynchronous mode (UART Mode) */
	/* UART configured as follows:
	  - Word Length = 8 Bits (7 data bit + 1 parity bit) : 
					  BE CAREFUL : Program 7 data bits + 1 parity bit in PC HyperTerminal
	  - Stop Bit    = One Stop bit
	  - Parity      = ODD parity
	  - BaudRate    = 9600 baud
	  - Hardware flow control disabled (RTS and CTS signals) */

	UartHandle.Instance        = Instance;

	UartHandle.Init.BaudRate   = BaudRate;
	UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
	UartHandle.Init.StopBits   = UART_STOPBITS_1;
	UartHandle.Init.Parity     = Parity;
	UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
	UartHandle.Init.Mode       = Mode;
	UartHandle.Init.OverSampling = UART_OVERSAMPLING_16;
	UartHandle.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
	UartHandle.Init.Prescaler = UART_PRESCALER_DIV1;
	UartHandle.Init.FIFOMode = UART_FIFOMODE_DISABLE;
	UartHandle.Init.TXFIFOThreshold = UART_TXFIFO_THRESHOLD_1_8;
	UartHandle.Init.RXFIFOThreshold = UART_RXFIFO_THRESHOLD_1_8;
	UartHandle.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
	if (HAL_UART_Init(&UartHandle) != HAL_OK)
	{
		/* Initialization Error */
		Error_Handler(__FILE__, __LINE__);
	}
}

/*
*********************************************************************************************************
*	函 数 名: InitHardUart
*	功能说明: 配置串口的硬件参数（波特率，数据位，停止位，起始位，校验位，中断使能）适合于STM32-F4开发板
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void InitHardUart(void)
{
	GPIO_InitTypeDef  GPIO_InitStruct;
	RCC_PeriphCLKInitTypeDef RCC_PeriphClkInit;
	UART_HandleTypeDef UartHandle;	
	
	/* Select SysClk as source of USART1 clocks */
	RCC_PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART16;
	RCC_PeriphClkInit.Usart16ClockSelection = RCC_USART16CLKSOURCE_D2PCLK2;
	HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphClkInit);	

#if UART1_FIFO_EN == 1		/* 串口1 */
	/* 使能 GPIO TX/RX 时钟 */
	USART1_TX_GPIO_CLK_ENABLE();
	USART1_RX_GPIO_CLK_ENABLE();
	
	/* 使能 USARTx 时钟 */
	USART1_CLK_ENABLE();	

	/* 配置TX引脚 */
	GPIO_InitStruct.Pin       = USART1_TX_PIN;
	GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull      = GPIO_PULLUP;
	GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = USART1_TX_AF;
	HAL_GPIO_Init(USART1_TX_GPIO_PORT, &GPIO_InitStruct);	
	
	/* 配置RX引脚 */
	GPIO_InitStruct.Pin = USART1_RX_PIN;
	GPIO_InitStruct.Alternate = USART1_RX_AF;
	HAL_GPIO_Init(USART1_RX_GPIO_PORT, &GPIO_InitStruct);

	/* 配置NVIC the NVIC for UART */   
	HAL_NVIC_SetPriority(USART1_IRQn, 0, 1);
	HAL_NVIC_EnableIRQ(USART1_IRQn);
  
	/* 配置波特率、奇偶校验 */
	bsp_SetUartParam(USART1,  UART1_BAUD, UART_PARITY_NONE, UART_MODE_TX_RX);
	
	// USART_CR1_PEIE | USART_CR1_RXNEIE
	SET_BIT(USART1->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */
#endif

#if UART2_FIFO_EN == 1		/* 串口2 */
	/* 使能 GPIO TX/RX 时钟 */
	USART2_TX_GPIO_CLK_ENABLE();
	USART2_RX_GPIO_CLK_ENABLE();
	
	/* 使能 USARTx 时钟 */
	USART2_CLK_ENABLE();	

	/* 配置TX引脚 */
	GPIO_InitStruct.Pin       = USART2_TX_PIN;
	GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull      = GPIO_PULLUP;
	GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = USART2_TX_AF;
	HAL_GPIO_Init(USART2_TX_GPIO_PORT, &GPIO_InitStruct);	
	
